//=================(C) COPYRIGHT  深圳市XXXXX电子有限公司 =====================
//公司名称：深圳市
//文件名称：BSP_PUBLIC.h
//功能概要：BSP_PUBLIC驱动头文件
//实验平台：
//寄存器版本 ：V1.0.0
//作者       ：胡显辉
//邮件或QQ   ：738275730@qq.com
//修改时间   ：2017-12-1
//=============================================================================



#ifndef BSP_PUBLIC_H
#define BSP_PUBLIC_H

#include <stdint.h>






//=============================================================================
//文件名称：void PVD_Init(void)
//功能概要：掉电检测初始化
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void PVD_Init(void);


//=============================================================================
//文件名称：uint8_t RCC_GetSYSCLKSource(void)
//功能概要：读取系统时钟
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

uint8_t RCC_GetSYSCLKSource(void);

//=============================================================================
//文件名称：void RCC_Configuration(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void RCC_Configuration(void);



//=============================================================================
//文件名称：void EnterSleepMode(void)
//功能概要：进入睡眠模式
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterSleepMode(void);

//=============================================================================
//文件名称：void EnterSTOPMode(void)
//功能概要：进入停止模式
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterSTOPMode(void);

//=============================================================================
//文件名称：void EnterSTANDBYMode(void)
//功能概要：进入STANDBY模式
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterSTANDBYMode(void);

//=============================================================================
//文件名称：void EnterSLEEP(void)
//功能概要：进入睡眠模式
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterSLEEP(void);

//=============================================================================
//文件名称：Power_Off
//功能概要：关电并进入低能耗状态
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void Power_Off(void);

//=============================================================================
//文件名称：stop_mode_config
//功能概要：在进入停机模式之前，按照ST官方例程，首先对引脚进行配置，设置成模拟输入状态。
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void stop_mode_config(void);

//=============================================================================
//文件名称：void EnterStopMode_GPIO_Interrupt(void)
//功能概要：配置外部中断唤醒
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterStopMode_GPIO_Interrupt(void);

//=============================================================================
//文件名称：void EnterStopMode(void)
//功能概要：配置进入停止模式，等待唤醒
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterStopMode(void);

//=============================================================================
//文件名称：void EnterStopMode_GPIO_Config(void)
//功能概要：配置所有引脚模拟输入
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void EnterStopMode_GPIO_Config(void);


//=============================================================================
//文件名称：void MCU_STOP(void)
//功能概要：进入停机模式
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void MCU_STOP(void);



void main2(void);


//=============================================================================
//文件名称：LowPowerIOConfig
//功能概要：低能耗配置
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void LowPowerIOConfig(void);


//=============================================================================
//文件名称：void PWM_SetCompare1(TIM_TypeDef* TIMx, uint16_t Compare1)
//功能概要：设置占空比
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

void PWM_SetCompare1(TIM_TypeDef* TIMx, uint16_t Compare1);

//=============================================================================
//文件名称：void PWM_SetCompare2(TIM_TypeDef* TIMx, uint16_t Compare1)
//功能概要：设置占空比
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//============================================================================

//void PWM_SetCompare2(TIM_TypeDef* TIMx, uint16_t Compare2);

//=============================================================================
//文件名称：void PWM_SetDutyRatio(TIM_HandleTypeDef *htim,uint32_t Channel,uint8_t value)
//功能概要：调整占空比函数 
//参数说明：value为占空比 value=50 即占空比为50%
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

//void PWM_SetDutyRatio(TIM_HandleTypeDef *htim,uint32_t Channel,uint8_t value);

//=============================================================================
//文件名称：void PWM_SetValue(TIM_HandleTypeDef *htim,uint32_t Channel,uint16_t value)
//功能概要：调整占空比函数 
//参数说明：value为占空比 value=50 即占空比为50%
//函数返回：无
//作者    ：胡显辉
//联系方式: 738275730@qq.com
//=============================================================================

//void PWM_SetValue(TIM_HandleTypeDef *htim,uint32_t Channel,uint16_t value);


//=============================================================================
//文件名称：void GLOBAL_USART1_Set(unsigned int baudrate)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void GLOBAL_USART1_Set(unsigned int baudrate);

//=============================================================================
//文件名称：void GLOBAL_USART2_Set(unsigned int baudrate)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void GLOBAL_USART2_Set(unsigned int baudrate);

//=============================================================================
//文件名称：void GLOBAL_USART3_Set(unsigned int baudrate)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void GLOBAL_USART3_Set(unsigned int baudrate);

//=============================================================================
//文件名称：void GLOBAL_UART4_Set(unsigned int baudrate)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void GLOBAL_UART4_Set(unsigned int baudrate);

//=============================================================================
//文件名称：void GLOBAL_UART5_Set(unsigned int baudrate)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void GLOBAL_UART5_Set(unsigned int baudrate);


//=============================================================================
//文件名称：void GLOBAL_UART5_Set(unsigned int baudrate)
//功能概要：无
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void GLOBAL_Module_Set(unsigned char module);




#endif /* BSP_PUBLIC */

