//=================(C) COPYRIGHT  深圳市XXXXX电子有限公司 =====================
//公司名称：深圳市
//文件名称：BSP_FUN.c
//功能概要：BSP_FUN驱动头文件
//实验平台：
//寄存器版本 ：V1.0.0
//作者       ：胡显辉
//邮件或QQ   ：738275730@qq.com
//修改时间   ：2017-12-1
//=============================================================================


#ifndef _BSP_FUN_H_
#define _BSP_FUN_H_

//系统名称与版本号
#define EXAMPLE_NAME	"Module Test"
#define EXAMPLE_DATE	"2020-11-06"
#define DEMO_VER	"1.2"




//=============================================================================
//文件名称：int fputc(int ch, FILE *f)
//功能概要：retarget the C library printf function to the USART
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

int fputc(int ch, FILE *f);

//=============================================================================
//文件名称：int fgetc(FILE *f)
//功能概要：retarget the C library printf function to the USART
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

int fgetc(FILE *f);


//=============================================================================
//文件名称：void delay_init(unsigned char SYSCLK)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void delay_init(unsigned char SYSCLK);

//=============================================================================
//文件名称：void delay_us(unsigned long nus)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void delay_us(unsigned long nus);

//=============================================================================
//文件名称：void delay_ms(unsigned int nms)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void delay_ms(unsigned int nms);

//=============================================================================
//文件名称：void delay_xms(unsigned int nms)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void delay_xms(unsigned int nms);

//=============================================================================
//文件名称：void delay_s(unsigned int ns)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void delay_s(unsigned int ns);

//=============================================================================
//文件名称：void led_spark(void)
//功能概要：toggle the led every 500ms
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void led_spark(void);


//=============================================================================
//文件名称：void Sys_Soft_Reset(void)
//功能概要：时钟初始化
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void Sys_Soft_Reset(void);


//=============================================================================
//文件名称：unsigned int Get_JTAG_ID(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

unsigned int Get_JTAG_ID(void);


//=============================================================================
//文件名称：unsigned int Get_MCU_ID(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

unsigned int Get_MCU_ID(void);

//=============================================================================
//文件名称：void IWDG_Init(uint32_t prer,uint32_t rlr)
//功能概要：独立看门狗初始化,void IWDG_Init(4，625)
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void IWDG_Init(uint32_t prer,uint32_t rlr);

//=============================================================================
//文件名称：void IWDG_Feed(void)
//功能概要：独立看门狗喂狗函数
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void IWDG_Feed(void);

//=============================================================================
//文件名称：void Get_CHIP_ID(void)
//功能概要：获取芯片ID
//参数说明：96位的ID是stm32唯一身份标识，可以以8bit、16bit、32bit读取
//           提供了大端和小端两种表示方法
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void Get_CHIP_ID(void);

//=============================================================================
//文件名称：void MCO_Output(void)
//功能概要：各类时钟输出测试
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void MCO_Output(void);

//=============================================================================
//文件名称：void Printf_SystemRccClocks(void)
//功能概要：打印系统时钟
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void Printf_SystemRccClocks(void);

//=============================================================================
//文件名称：PrintfLogo
//功能概要：打印例程名称和例程发布日期, 接上串口线后，打开PC机的超级终端软件可以观察结果
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void PrintfLogo(void);

//=============================================================================
//文件名称：Get_ChipInfo(void)
//功能概要：获取芯片Flash 大小
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void Get_ChipInfo(void);

//=============================================================================
//文件名称：void error_handler(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void error_handler(void);

//=============================================================================
//文件名称：ErrorStatus memory_compare(uint8_t* src, uint8_t* dst, uint8_t length) 
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

ErrorStatus memory_compare(uint8_t* src, uint8_t* dst, uint8_t length);

//=============================================================================
//文件名称：void HAL_GPIO_Pin_Setting(GPIO_TypeDef *gpio, uint32_t nPin, uint32_t mode, uint32_t pull, uint32_t speed)
//功能概要：CPIO设置
//参数说明：重新设置GPIO
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void HAL_GPIO_Pin_Setting(GPIO_TypeDef *gpio, uint32_t nPin, uint32_t mode, uint32_t pull, uint32_t speed);

//=============================================================================
//文件名称：HAL_GPIO_PinState GPIO_ReadPinInput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
//功能概要：读取引脚输入状态
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

GPIO_PinState HAL_GPIO_ReadPinInput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);

//=============================================================================
//文件名称：GPIO_PinState HAL_GPIO_ReadPinOutput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
//功能概要：读取引脚输出状态
//参数说明：无
//函数返回：无
//作者    ：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

GPIO_PinState HAL_GPIO_ReadPinOutput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);




//=============================================================================
//文件名称：void spi_config(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void spi_config(void);


//=============================================================================
//文件名称：void early_init(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void early_init(void);

//=============================================================================
//文件名称：void early_task(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void early_task(void);

//=============================================================================
//文件名称：void later_init(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void later_init(void);

//=============================================================================
//文件名称：void later_task(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void later_task(void);

//=============================================================================
//文件名称：void main_loop(void)
//功能概要：无
//参数说明：无
//函数返回：无
//作者	：胡显辉
//联系方式: Steven.Hu 日期：2020年3月23日 738275730@qq.com
//=============================================================================

void main_loop(void);


#endif


